[
{"rating": "4.2 out of 5 stars", "description": ["13MP rear camera | 5MP front camera ; Slender Design: A thin, curved design for total holdability", "13.8 centimeters (5.45-inch) HD+ multi-touch capacitive touchscreen with 1440 x 720 pixels resolution, 295 ppi pixel density and 18:9 aspect ratio ; AI-powered face unlock Unlock with a single glance", "Memory, Storage and SIM: 2GB RAM | 32GB internal memory expandable up to 256GB | Dual SIM (nano+nano) dual-standby (4G+4G)", "Android v8.1 operating system with All new 12nm manufacturing process 4 X 2.0GHz high performance processor", "3000mAH lithium-ion battery ; Built-in rechargeable battery, 5V/1A charging", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase"], "title": "Mi Redmi 6A (Black, 2GB RAM, 32GB Storage)", "colour": "Black", "brand": "Redmi", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/510d4L0LYKL._SL1325_.jpg"], "reviews": ["Redmi 6A has lag problems. This phone is hanging and lags while using YouTube and browser.Redmi 5A is far better than Redmi 6A. I am regretting on my decision for buying this phone. Not satisfied.", "I am going to step you through each aspect of the phone and my thoughts so far.", "Short Version", "Pro's", "- Good budget phone for any one India.", "- Battery life is shockingly good. (ha)", "- Phone feels amazing in the hand", "- Durability of this thing is on point, designed to last instead of break.", "- Speaker sounds not up to mark and even volume.", "- Design part I love it very much", "Con's", "- Picture quality not good they given13 MP Rear camera | 5 MP front camera.", "- Stock camera software is extremely basic, enough for most users but weak for those looking for those great shots.", "- Screen size is not 5.5 inch.", "- Processor can get a little hung up every once and a while but it's barely noticeable.", "- Phone feels so nice that putting a case on it just feels bad encouraging you not to protect it and you should always use protection.", "- It doesn't make me breakfast.", "Overall, what Redmi phone does not everything but it’s budget friendly phone.", "Pros: 1) Decent Video/audio recording with minimum distortion.", "  (noise cancellation is much much better than Redmi 5a)", "  2) Decent Camera for a budget phone.", "  3) good for Android smartphone beginners.", "  4) Can run 3-4 apps in the background without lag/hanging.", "  5) Fast boot.", "  6) Good touch response for a budget phone,  I find it to extra sensitive. haha", "Cons: 1) Bad Video quality for watching movies/ you tube. But I use phone only for calls, whatsapp and sometimes Instagram. I use my laptop to watch movies, so not a big deal for me.", "  2) Unable to share Internet hotspot to computer/Laptop. But I posted a tip on how to solve this problem in MI community India. All you need to do is download an app called PDANet+ (available in Google play store) in both your phone and computer. Go and check it out.", "  Apart from the few drawbacks mentioned above, this phone is quite good for a budget phone. If you can live without the good video quality by watching movies/videos on another device, go for it. The 1440X720 resolution is much worse compared to Redmi 5a's 1280X720. In fact Redmi 5a's video/picture resolution is much better and detailed compared to Redmi 6a. Ordered and received another redmi 6a for my dad.", "I am a big fan of redmi products. I have redmi2, redmi 2 prime and redmi note4.", "So, I decided to by a phone for my Dad and purchased Redmi 6A thinking is its same  or better than its ancestor .", "But all my assumptions failed and here are my detailed analysis", "1. Picture quality is not full HD and you don't enjoy if you already have full HD phone", "2. Camera very very poor quality", "3. Ram size is only 2GB and 16 GB thats bad for the price 5999 and that to long wait.", "Note: I returned this phone and purchased Lenova K8 plus which is awesome with specs 3GB ram and 32 GB harddisk with depth enabled camera and stock android.", "Redmi this time you failed me", "Android Oreo 8 itself required 2GB RAM and consuming entire RAM. no memory for applications. Videos play are not good. Not good for Amazon prime videos and hooq. Bloatware found difficult to remove. Not good for e-commerce and mobile banking. Internet browsing experience is unhappy. Poor performance because lack of memory. Just useful for basic phone calls. Only some small applications run without lagging. Worst and limited user interface. Very costly basic phone. Reliance Jio basic phone is far better than this one. This is my first highly unsatisfied purchase from Amazon. My recent 10 or G,even my old GIONEE M2 is better than this. I am not understanding how companies are releasing Oreo 8 phones with 2GB RAM. The hardware configuration may good but difficult to judge because of less RAM.", "*My personal suggestion* Don't buy any phone with 2GB RAM with Android Oreo 8, what ever the hardware configuration may be. You need atleast 3GB RAM.", "I was quite skeptical before buying this phone for my son. I had read many bad as well as gud reviews about it so was quite confused 😕", "Finally I placed the order and bought it through Amazon.", "Believe me it fabulous product so far.", "The screen is apt and very clear.", "Battery life is very gud and lasts full whole day with heavy use by my son on games etc.", "Memory is 32 GB so lot of space for apps and other material. Infact in these days one shud not buy phone less than 32 GB memory as the no of apps we use are quite large in number and that itself consume huge space.", "Phone is quite light weight and very smart. I chose blue color and believe me it looks classy.", "Only issue it does not come with earphones🤔🤔🤔", "I respect the adverse reviews of many customers as they might have faced some issues but I recommend this to all buyers.", "In nutshell its not only value for money but gud choice too.", "Cheers 👍🥂", "The Service center service at MI is very bad, You go with one problem and come back with many other issues, samsung or oppo phone, service is the best thats what my friends say, Mi may look attractive with the price tag, but after sales is service is not good experience, think twice before buying MI Phones.", "Love the phone. Everything on it works as expected.  I've been using this phone for about 1 weeks, and so far I'm loving it. Here's me breakdown:", "The quality, fit and finish are amazing. No one believes this is low priced phone.", "Battery: exceptional battery life, the best in any smartphone I've had so far.", "Build/design: one of the best smartphone designs and build quality I've used, even compared to much more expensive models.", "Camera: not as good as my Honor 7C, but still takes good enough pictures that it's not really a problem for me.", "Really littil bit difficult to find fault with this phone, especially for the price even I don't like the audio quality. overall Best Product. Durable solid feel, very responsive and works great overall."], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/510d4L0LYKL._SL1325_.jpg", "path": "full/cab0398591831311a437cc99262da69bbad4db0a.jpg", "checksum": "3db0f3c0815cbdde49a67701b432a056"}], "price": "₹ 5,499.00"},
{"rating": "4.0 out of 5 stars", "description": ["13MP+5MP ultra-wide angle dual camera | 5MP f2.0 front camera. The internet usage time is 15 hours for 3G as well as 19 hours for LTE.The video playback time is 17 hours and audio playback time is 84 hours", "15.8cm (6.22\") HD+ Infinity V Display with 90% screen ratio", "3GB RAM and 32GB internal memory expandable up to 512GB in a dedicated slot", "Fast face unlock | 3400 mAh lithium-ion battery", "Dual SIM (nano+nano) with dual standby and dual VoLTE", "1.6GHz Exynos 7870 octa-core processor | Android Oreo v8.1 OS", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase"], "title": "Samsung Galaxy M10 (Ocean Blue , 3GB RAM, 32GB Storage)", "colour": "Ocean Blue", "brand": "Samsung", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/613Os2k0a2L._SL1500_.jpg"], "reviews": [" Well, I was a bit sceptical before buying this Samsung Galaxy M10, so", "I bought this", "phone on the second sale & placed the order for the variant ie", "3GB+32GB for ₹8990. Here is the detailed review of this device with", "pros and cons ratings. Few camera samples are also attached to this", "review.", "Pros:-", "1) Very lightweight", "2) It looks beautiful and has a huge display", "3) Nice crisp display", "4) The infinity V display looks great", "5) Ultra Wide dual rear camera", "6) Dedicated Micro SD card slot", "7) No heating issues", "8) Face unlock works smoothly", "Cons:-", "1) The rear camera is worse", "2) The back panel of the phone is not that good", "3) It is not having fast charging support as it is having a USB port.", "4) No Fingerprint scanner", "5) Only 2.4Ghz Wifi Support", "6) Not a PUBG Phone", "7) Bloatware (Though we can disable them)", "8) Bigger bottom bezel than M20", "9) 1Amp Charger in the box", "Ratings:-", "Design: 7/10", "Display: 9.5/10", "Battery: 7/10", "Back camera: 6/10", "Front Camera: 7/10", "Processor: 7/10", "Call Quality: 8/10", "Face unlock & Fingerprint: 7/10", "Speakers: 8/10", "Pricing: 8.5/10", "Now let's come to the detailed review:-", "# Box contents:- In the box, you will get the handset, Charging", "adapter, USB cable, Sim ejector tool and user manual.", "# Design:- The design of M10 is great and I bought the black variant,", "it looks beautiful in hand and as I said earlier it is an attention", "grabber.", "# Build Quality:- It is fully made up of plastic & and the back side", "of the phone is having plastic finishing but it is polycarbonate and", "it is very prone to scratches. I will suggest you buy a back cover.", "# Display:- It is having 16CM (6.3) FHD+ Dewdrop full view display,", "with broad 90.8% screen-to-body ratio, 19.5:9 aspect ratio, and 2.5D", "Gorilla Glass, it gives the screen a premium look. The bezels are less", "and the bottom chin is quite very thin which makes the viewing best. The", "viewing experience is great and in sunlight the screen is visible.", "# Battery:- It is loaded with 3400 mAh battery, if you are a moderate", "user, it can give you the battery backup for around 1 day or more and", "if you a gamer (playing high-end games) it can give you a backup for", "whole day.", "* I have charged this phone from 20% to 100% the time taken was 2", "hours 20 minutes.", "# Audio:- The speaker of this phone is very crisp and clear. The audio", "through the earphones are just WOW and you will also get an opinion", "for the Equalizer in the phone settings.", "# Performance:- The M10 runs on 1.6 GHz Exynos 7904 octa-core", "processor. All the high-end games like PUBG, Asphalt 9, Unkilled runs", "average. You cant get winner chicken dinner with this phone", "easily.", "# Camera:- It is having selfie-5 MP front camera and the rear camera", "is having 13 MP+5 MP ultra-wide angle dual camera. The front camera works", "best under natural lighting conditions, but the rear camera struggles a", "lot in low light conditions. (I have attached a few camera samples)", "# Security:- The face unlock is not that fast and we should be as well worried about the security, I've seen few videos on Youtube where users have by-passed it.", "# Connectivity:- It supports 4G LTE connectivity and in the WiFi, it", "supports 2.4GHz routers if you are having a 5GHz router then this", "the phone will not support the frequency (Attached a screenshot and video)", "# Pricing:- The pricing of M10 starts for ₹7990 ie for the base", "variant (2GB + 16GB) and the other variant ie (3GB + 32 GB) is priced", "for ₹8990. If you are looking for a budget smartphone for less than ₹9000 then I will recommend you to go for the 3+32 variant of the Samsung Galaxy", "M10.", "#SUMMARY:-", "If you are in a very tight budget with ₹9000 then I will definitely", "recommend you to buy the 3+32 GB variant of the Samsung Galaxy M10", "because at this price point it offers you good performance(NOT FOR", "HARDCORE GAMING ONLY FOR MODERATE USAGE AND MODERATE GAMING), an okayish build & looks, crisp and clear screen, loud & crisp speakers, a decent dual rear camera and a decent front camera. If you want a good phone with gaming at a budget price range then don’t go for this phone.", "This phone gives a very nice completion to the many phones out there in", "the market like Redmi 6, Redmi 6 pro, etc.", "I hope my review was helpful!", "It's a worthless phone with only dislikes. The product is not up to the mark, the built quality, the resolution and the best part is the the camera is even worse. The dual camera is for name sake and you end up having pathetic pictures. It's best to have some different category phone for the same price brand rather than going for M10.", "Also please note Amazon is not providing any service to return the product. They are just over promoting and overhyped the product to  catch the customers in the  net. Once it's sold as per them, they can't help.", "Crux of the story from my side is don't go for it.", "Ordered this product in the First Sale. And i have to say samsung has done a really good job in the budget segment. Phone Doesnt look or feel cheap.", "Pros:-", "1. price is really competetive with Samsung Branding", "2. Battery Life is Good", "3. Screen Looks Great with hd+ Resolution", "4. front Camera Is good enought for selfies", "5. phone is light weight", "Cons :-", "1. Rear Camera is not that great. But still u get a ultra wide lens at entry level smart phone", "2. No headphones included", "3. Low internal Storage at base model", "At price of 7990 its a great phone. I just bought this to  review.. U should go with atleast 32gb Model its more practical in daily life. Phone Works Great in day to day life. exysnos 7870 is good enough to  handle daily tasks.. and Samsung Experience 9.5 feels snappy.", "Technoholic Life", " Don't buy this phone. Because phone itself switching off automatically. This phone not switching on please watch the video", "Well phone is quite nice in look.", "Battery performance is excellent.", "Samsung did really good job in theme .", "Phone should have an internal app lock as i think", "Pros:", "1 . Display  touch response is excellent.", "2 . Wide angle camera is quite impressive.", "3. Batter backup is great .", "4. Phone runs smooth.", "5. Boot time is fast", "Cons :", "1. No led light for notification and charging.", "2. No time lapse and hdr mode in camera", "3. Face lock is slow and might work too late in less lighted area.", "4. Pubg is quite slow in these phone but can play in low settings..", "5. Front camera is shakky sometimes.", "There is nothing special about this phone except big screen.", "1. Camera experience is worst ever compared to other phones in this range.", "2. Poor body build.", "3. You Tube videos shows blur, even you play HD videos .", "4. Backup is not up to the mark. It takes almost 3.5 hrs to recharge.", "5. I strongly recommend not to buy this Samsung M10 and even Amazon return policies are worst. So think read all T&C before going with this product.", "Excellent Phone in this budget. I've gifted it to someone. She likes it very much. Ocean color is awesome. Performance is also very good. Light weighted. Handy Phone.", "Amazing mobile for best price happy with product"], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/613Os2k0a2L._SL1500_.jpg", "path": "full/9095a2873a676586b8da4faf926b46ffaaf45d34.jpg", "checksum": "a4cfb99edb8bafd80a08805c3fc22a6a"}], "price": "₹ 7,999.00"},
{"rating": "3.7 out of 5 stars", "description": ["48+8+2MP AI triple rear camera with portrait mode, HDR, PDAF supported | 32MP front camera with f2.0, 1/2.8 inch pixel size, portrait mode, HDR supported", "15.46 centimeters (6.088-inch) AMOLED multi-touch capacitive touchscreen with 1520 x 720 pixels resolution, 282 ppi pixel density", "Memory, Storage & SIM: 4GB RAM | 64GB internal memory expandable up to 256GB | Dual SIM (nano+nano) dual-standby (4G+4G)", "Android Pie v9.0 operating system with 2.0GHz Qualcomm Snapdragon 665 octa core processor, Adreno 610 GPU", "4030mAH lithium-ion battery, AI Scene detection: Detects up to 12 different scenes", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Power adapter, USB cable, warranty card, user guide, SIM tray ejection tool and back cover", "The low SAR value(1.6W/kg) of Mi A3 means that a minimal amount of RF energy is absorbed by the body when using a mobile phone, making it extremely safe"], "title": "Xiaomi Mi A3 (Not just Blue, 4GB RAM, AMOLED Display, 64GB Storage, 4030mAH Battery)", "colour": "Not Just Blue", "brand": "Xiaomi", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81duLAWicbL._SL1500_.jpg"], "reviews": [" I've been a big fan of MIUI since when I switched to my first android phone from iOS but some of phones disappointed me later. But this time I must say that this Mi A3 phone is really a dynamite you get in range of murga Chhaap. Let me share my review after using this phone you all;", "✓✓ PROS;", "1) AMOLED display (After Samsung A20 its first phone to give AMOLED display in this range. Screen replacement will cost you over 6k),", "2) Qualcomm 610, performance was really upto my expectations,", "3) Inscreen Fingerprint sensor,", "4)  8mp Ultra wide angle camera+ 48mp primary with big aperture f/1.79 and 32mp secondary camera,", "5)  UFS 2.1 (UFS is used in high end smartphones like Samsung galaxy S8 and OnePlus, it's replacement to eMMC memory,", "6) Splashproof,", "7) Slow motion recording shoots better than OnePlus 6 indor as I experienced. Shoots 720p at the rate of 240fps/120fps & 1080p at the rate of 120fps,", "8) 4030MaH battery which gives you over a week contentious music playback (187Hrs) and standby time is 20 days,", "9) It supports Quickcharge 3.0, that gives you ridiculously fast charging,", "WHY FOUR STARS 🌟 ??", "XX Cons;", "1) Quickcharge 3.0 supports 18watt charger but in box you get 10w charger by default,", "2) Fingerprint sensor is relatively slower than other phones which have this feature till.the time,", "3) NFC is no thing for future, all digital accesories support its going to be a basic feature later,", "4)  Screen brightness is little low as compared to other phones when brightness is full manually,", "5) 6.08 inches display seems small when you've been accustomed of using 6.3+ display in almost all phones these days + Screen resolution & ppi are also average,", "6) All phones boast in the name of dual camera with a main camera supported by a 2mp camera. Mi A series phones were different (Mi A1 had 12mp+12mp and Mi A2 had 12mp+ 20mp) but now Mi A3 has 48mp +2mp along with one ultra wide angle camera of 8mp with aperture of f/2.2,", "7) Earlier model Mi A2 had larger aperture in both primary cameras f/1.75 each", "Final verdict;", "There's no phone stands or even walks near it at present.", "If NFC, Screen resolution and RAM can be compromised than it's better than MI CC9 whose price is far greater than this phone", "In box you get;", "Mi A3, Power adapter, USB cable, warranty card, user guide, SIM tray ejection tool and back cover", "You can make your decision on this product by reading my review. Do hit HELPFUL if you find it helpful to keep me motivated for writing detailed reviews of products I buy and do not forget to follow me for getting access to great deals on your favorite products from my Amazon storefront", "The Mi A3 doesn't look like its predecessors, and that's a good thing.", "It's a bit of a stretch to access the notification panel when using the phone one-handed, but other than that it's a great size.", "Even though getting an AMOLED panel, the 720p resolution is just not good enough for a device in this segment.", "There is a camera bump at the back, with the sensor protruding slightly from the body. That leads to a wobble when using the device on a flat surface, which tends to get annoying.", "The in-display fingerprint reader is slow, unreliable, and just not worth the effort.", "When you consider the low-resolution screen, large battery, and modern soc, it’s not difficult to see why the Mi A3 offers good battery life. I easily got a full day of usage with this phone, using it mostly for browsing social media and watching YouTube videos.", "The Mi A3 does a fantastic job in daylight conditions, with excellent contrast levels, wide dynamic range, and accurate colors. The wide-angle lens doesn't do as good a job, but the resultant images are decent enough for sharing on social media platforms. Photos taken in low-light conditions aren't detailed enough, and there's a lot of noise, and using the dedicated night mode fixes the issue to an extent. The camera overall is pretty decent considering how much the Mi A3 costs.", "The best part about the Mi A3 is undoubtedly the software. Like every other Android One device, the Mi A3 has a clean user interface with no bloat ware.", "Positives:", "-Android One goodness", "-Premium design", "-Decent camera", "-Fantastic battery life", "-3.5mm jack is back", "Negatives:", "-The in-display fingerprint sensor is terrible", "-Low-resolution display", "The Mi A3 is a decent showing if you're looking for a budget Android One device, but there are plenty of other phones in the market at around the same price point that come with more features.", "Added some latest photos clicked after 15 days of use from Mi A3.", "One of d best phone by mi.i was using Mi A1 since 2 years. This is far ahead than that.", "Only on drawback is HD+ display but thanks to AMOLED screen it covers the gap..", "Thanks xiaomi and thanks Amazon for one day delivery", "Less internal features, more app space occupied upto 22gb", "This is a review after few days of usage.", "Pros:", "1. Processor and RAM, ROM options are very nice.", "2. Front camera excellent.", "3. Pretty compact and comes handy.", "4. Gorilla glass on front and back.", "5. Android one, is best option. Comes with minimum changes to original Android.", "6. Nice color options, white is lovely.", "7. Adding 3.5mm jack which is not available in mi a2.", "8. IR blaster is very handy option to controll many devices in home.", "Cons:", "1. Display is 720p, not a good as previous Mi A2.", "2. Camera quality is upto the mark, I mean for 48Mp camera one would expect stunning performance, which is lacking. But decent.", "3. No low light photography options.", "4. Onscreen finger print is laggy. But face unlock is fast.", "26th August I received MI A3 and I used one day I feel once feature is missing ( Call Recording ) guys if you need this feature go with Redmi Note 7 pro. Because Google never full fell your demanded", "I would like to request all the buyer not to buy this mobile because this is the worst mobile in the world.", "The display pixel is like sand grains size", "They advertising super AMOLED but I think that it is a tft LCD panel", "The photos are awful because the display will not be able to to display the photos", "I don't want to talk about the finger print scanner. That is awful.", "I have never seen a display even in my keypad mobile.", "It's my humble request to all the buyer please don't buy this mobile.", "Don't be mad for the flash sale mi will be always there to make you fool .", "Very poor display even though Xiaomi claiming for S Amoled. Those who concerned about display don’t buy it."], "instock": false, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81duLAWicbL._SL1500_.jpg", "path": "full/1c9b450807f7283cd86d0631c41d507b60913bf8.jpg", "checksum": "4bdf76661875e12122b5d4ee71d12284"}], "price": "₹ 12,999.00"},
{"rating": "4.3 out of 5 stars", "description": ["48MP + 8MP + 5MP triple rear camera | 16MP front facing camera", "16.21 centimeters (6.4-inch) FHD+ capacitive touchscreen with 2340 x 1080 pixels resolution 16M color support", "Memory, Storage & SIM: 6GB RAM | 128GB storage expandable up to 512GB | Dual nano SIM with dual standby (4G+4G)", "Android v9.0 Pie operating system with 2.3GHz + 1.7GHz Exynos 9611 octa core processor", "6000mAH lithium-ion battery with fast charging | 15W Type-C fast charger in the box", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Travel Adapter, USB Cable, Ejection Pin, User Manual"], "title": "Samsung Galaxy M30s (Pearl White, 6GB RAM, Super AMOLED Display, 128GB Storage, 6000mAH Battery)", "colour": "Pearl White", "brand": "Samsung", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71iPcMPwOBL._SL1500_.jpg"], "reviews": ["Excellent features, there is no con at all... i am enjoying all the way.. flagship mobile features with low budget price... go for it.", "Detailed Review:", "Camera: The rear and front camera quality is great, night mode is good enough to capture good shots. Additional zoom-out features for both front and rear camera is nice to have.", "Battery: I am really happy with battery backup as it lasts up to approx 2 days. Yes, approx 48 hours with medium usage including WiFi and GPS.", "Design, Touch, Look & Feel is awesome and even though it has a 6000mAh battery, it feels light.", "The face recognition is also quick to sense and unlock. The processing speed is good enough for heavy games without much heating effect.", "after 5 days of uses:", "Camera 5/5", "Performances 5/5", "Display 5/5", "Battery 5/5", "Phone look 5/5", "User interface 5/5", "Sound 5/5", "awesome phone", "Best phone with this budget. Best battery.", "Mst phone hain", "a very good smartphone for millennials having monster battery, superior big screen and fast exynos processor.", "the phone has a slippery backcase.", "overall a great smartphone at budget price.", "Received today best buy at given price.", "Awesome Battery life"], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71iPcMPwOBL._SL1500_.jpg", "path": "full/8f0f3e18f34c3788476d96eadc498c575bf58855.jpg", "checksum": "0eca20b35e99a3cbb1f655d17cb00d1e"}], "price": "₹ 16,999.00"},
{"rating": "4.3 out of 5 stars", "description": ["13MP + 5MP primary camera | 8MP front facing camera", "16.21 centimeters (6.4-inch) HD+ capacitive touchscreen with 720 x 1560 pixels resolution 16M color support", "Memory, Storage & SIM: 3GB RAM | 32GB storage expandable up to 512GB | Dual nano SIM with dual standby (4G+4G)", "Android v9.0 Pie operating system with 1.6 GHz + 1.35 GHz Exynos 7884B octa core processor", "4000mAH lithium-ion battery with fast charging | 15W Type-C fast charger in the box", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Travel Adapter, USB Cable, Ejection Pin, User Manual"], "title": "Samsung Galaxy M10s (Stainless Black, 3GB RAM, Super AMOLED Display, 32GB Storage, 4000mAH Battery)", "colour": "Stainless Black", "brand": "Samsung", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71vZUidoQ7L._SL1500_.jpg"], "reviews": ["Good price value... Samsung m series i loved it", "Good design really liked it. As per YouTube reviews they say the build quality of screen is not good as it doesn't have gorilla glass have to wait and see", "Please please don't buy it this phone has heating problem it is overheating all time Samsung you break our trust please don't make this type of phone that disappoint your die hard fan", "Very good product within range of 10k.", "Working auperb", "Excellent Mobile, worth for money", "Selfie camera could have been better", "Nice phone in this price awesome", "Valuable product"], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71vZUidoQ7L._SL1500_.jpg", "path": "full/78907be0e703035a7a507dade24e960949c4e59b.jpg", "checksum": "17b5f99a88d6aca626a7569f6d30511f"}], "price": "₹ 8,999.00"},
{"rating": "3.7 out of 5 stars", "description": ["13MP+2MP dual rear camera with bokeh mode, time lapse, portrait mode, face cute, 6 level beauty mode | 16MP front camera", "15.7988 centimeters (6.22-inch) HD+ TFT-IPS dewdrop screen display with 1520 x 720 pixels resolution and 16M color support", "Memory, Storage & SIM: 4GB RAM | 64GB internal memory expandable up to 128GB | Dual SIM (nano+nano) dual-standby (4G+4G)", "Android Pie v9.0 operating system with 2.0GHz Mediatek Helio P22 octa core processor", "4000mAH lithium-Ion battery providing talk-time of 18 hours and standby time of 200 hours with type C charging with OTG support", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Travel charger, USB cable, warranty card, quick start guide, eject tool, protective case and protective screen film"], "title": "Coolpad Cool 5 (Gradient Blue, 4GB RAM, 64GB Storage)", "colour": "Gradient Blue", "brand": "Coolpad", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61TYVblS44L._SL1500_.jpg"], "reviews": ["Good", "Awesome look and high speed processers", "Good phone", "Coolpad you disappoint us.", "Nice phone"], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/61TYVblS44L._SL1500_.jpg", "path": "full/ee377ea77f4584a444609ee0bc4853cb84050f11.jpg", "checksum": "bcd07679437f8f9436428f30056f8ced"}], "price": "₹ 7,999.00"},
{"rating": "4.3 out of 5 stars", "description": ["48MP + 8MP + 5MP triple rear camera | 16MP front facing camera", "16.21 centimeters (6.4-inch) FHD+ capacitive touchscreen with 2340 x 1080 pixels resolution 16M color support", "Memory, Storage & SIM: 4GB RAM | 64GB storage expandable up to 512GB | Dual nano SIM with dual standby (4G+4G)", "Android v9.0 Pie operating system with 2.3GHz + 1.7GHz Exynos 9611 octa core processor", "6000mAH lithium-ion battery with fast charging | 15W Type-C fast charger in the box", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Travel Adapter, USB Cable, Ejection Pin, User Manual"], "title": "Samsung Galaxy M30s (Sapphire Blue, 4GB RAM, Super AMOLED Display, 64GB Storage, 6000mAH Battery)", "colour": "Sapphire Blue", "brand": "Samsung", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71EvOK7BhuL._SL1500_.jpg"], "reviews": ["Excellent features, there is no con at all... i am enjoying all the way.. flagship mobile features with low budget price... go for it.", "Detailed Review:", "Camera: The rear and front camera quality is great, night mode is good enough to capture good shots. Additional zoom-out features for both front and rear camera is nice to have.", "Battery: I am really happy with battery backup as it lasts up to approx 2 days. Yes, approx 48 hours with medium usage including WiFi and GPS.", "Design, Touch, Look & Feel is awesome and even though it has a 6000mAh battery, it feels light.", "The face recognition is also quick to sense and unlock. The processing speed is good enough for heavy games without much heating effect.", "after 5 days of uses:", "Camera 5/5", "Performances 5/5", "Display 5/5", "Battery 5/5", "Phone look 5/5", "User interface 5/5", "Sound 5/5", "awesome phone", "Best phone with this budget. Best battery.", "Mst phone hain", "a very good smartphone for millennials having monster battery, superior big screen and fast exynos processor.", "the phone has a slippery backcase.", "overall a great smartphone at budget price.", "Received today best buy at given price.", "Awesome Battery life"], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71EvOK7BhuL._SL1500_.jpg", "path": "full/28f4ce8c93defd968607c79d523c09669e5ce43e.jpg", "checksum": "875616166fa15a25b3d3837f18f87971"}], "price": "₹ 13,999.00"},
{"rating": "4.3 out of 5 stars", "description": ["13MP + 5MP primary camera | 8MP front facing camera", "16.21 centimeters (6.4-inch) HD+ capacitive touchscreen with 720 x 1560 pixels resolution 16M color support", "Memory, Storage & SIM: 3GB RAM | 32GB storage expandable up to 512GB | Dual nano SIM with dual standby (4G+4G)", "Android v9.0 Pie operating system with 1.6 GHz + 1.35 GHz Exynos 7884B octa core processor", "4000mAH lithium-ion battery with fast charging | 15W Type-C fast charger in the box", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Travel Adapter, USB Cable, Ejection Pin, User Manual"], "title": "Samsung Galaxy M10s (Metallic Blue, 3GB RAM, Super AMOLED Display, 32GB Storage, 4000mAH Battery)", "colour": "Metallic Blue", "brand": "Samsung", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/711vPkqkrDL._SL1500_.jpg"], "reviews": ["Good price value... Samsung m series i loved it", "Good design really liked it. As per YouTube reviews they say the build quality of screen is not good as it doesn't have gorilla glass have to wait and see", "Please please don't buy it this phone has heating problem it is overheating all time Samsung you break our trust please don't make this type of phone that disappoint your die hard fan", "Very good product within range of 10k.", "Working auperb", "Excellent Mobile, worth for money", "Selfie camera could have been better", "Nice phone in this price awesome", "Valuable product"], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/711vPkqkrDL._SL1500_.jpg", "path": "full/4e9dacd37cec09e5b4a89d3261e83d57c0e7615d.jpg", "checksum": "3d45ca023a4493b66af72cbb72d9cb6f"}], "price": "₹ 8,999.00"},
{"rating": "4.4 out of 5 stars", "description": ["13MP + 2MP rear camera | 8MP front facing camera", "15.79 centimeters (6.2-inch) HD+ capacitive touchscreen with 720 x 1560 pixels resolution 16M color support", "Memory, Storage & SIM: 3GB RAM | 32GB storage expandable up to 512GB | Dual nano SIM with dual standby (4G+4G)", "Android v9 Pie operating system with 2GHz + 1.5GHz MediaTek MT6762 octa core processor", "4000mAH lithium-ion battery", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Travel Adapter, USB Cable and User Manual"], "title": "Samsung Galaxy A10s (Blue, 3GB RAM, 32GB Storage) with No Cost EMI/Additional Exchange Offers", "colour": "Blue", "brand": "Samsung", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81O4w9rCd0L._SL1500_.jpg"], "reviews": ["Camera good", "A10s TFT disply 2/32  low build quality", "M10s samled disply 3/32 only 8999", "A very good phone cramear,ram", "Superb quality and performance for general use. If U are a gaming person  then it is not good in 2 GB. But all the performance with video quality and photo is good.", "Very gud product,im very happy👍👍👍😁", "Good best phone ever", "Brilliantly priced product", "I bought this Samsung galaxy A10s.", "Mobile is really good. I am glad that i brought this phone. Nd it was pretty good decision to buy this phone from Amazon"], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81O4w9rCd0L._SL1500_.jpg", "path": "full/2034d307fbcf07e111bc126a2ab4c6b860c77039.jpg", "checksum": "3c75f60c112b533504af2d71180cfd62"}], "price": "₹ 10,490.00"},
{"rating": "4.3 out of 5 stars", "description": ["48MP + 8MP + 5MP triple rear camera | 16MP front facing camera", "16.21 centimeters (6.4-inch) FHD+ capacitive touchscreen with 2340 x 1080 pixels resolution 16M color support", "Memory, Storage & SIM: 4GB RAM | 64GB storage expandable up to 512GB | Dual nano SIM with dual standby (4G+4G)", "Android v9.0 Pie operating system with 2.3GHz + 1.7GHz Exynos 9611 octa core processor", "6000mAH lithium-ion battery with fast charging | 15W Type-C fast charger in the box", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Travel Adapter, USB Cable, Ejection Pin, User Manual"], "title": "Samsung Galaxy M30s (Opal Black, 4GB RAM, Super AMOLED Display, 64GB Storage, 6000mAH Battery)", "colour": "Opal Black", "brand": "Samsung", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71p2%2B%2B3ufvL._SL1500_.jpg"], "reviews": ["Excellent features, there is no con at all... i am enjoying all the way.. flagship mobile features with low budget price... go for it.", "Detailed Review:", "Camera: The rear and front camera quality is great, night mode is good enough to capture good shots. Additional zoom-out features for both front and rear camera is nice to have.", "Battery: I am really happy with battery backup as it lasts up to approx 2 days. Yes, approx 48 hours with medium usage including WiFi and GPS.", "Design, Touch, Look & Feel is awesome and even though it has a 6000mAh battery, it feels light.", "The face recognition is also quick to sense and unlock. The processing speed is good enough for heavy games without much heating effect.", "after 5 days of uses:", "Camera 5/5", "Performances 5/5", "Display 5/5", "Battery 5/5", "Phone look 5/5", "User interface 5/5", "Sound 5/5", "awesome phone", "Best phone with this budget. Best battery.", "Mst phone hain", "a very good smartphone for millennials having monster battery, superior big screen and fast exynos processor.", "the phone has a slippery backcase.", "overall a great smartphone at budget price.", "Received today best buy at given price.", "Awesome Battery life"], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71p2%2B%2B3ufvL._SL1500_.jpg", "path": "full/a8d1e8937a57620d057625c0089f61ee5dcfbd0a.jpg", "checksum": "8a4b4d2727a2742d038b3315b7404eb7"}], "price": "₹ 13,999.00"},
{"rating": "4.1 out of 5 stars", "description": ["12MP+2MP dual rear camera | 8MP front facing camera", "15.9004 centimeters (6.26-inch) with 1520 x 720 pixels resolution, 269 ppi pixel density", "Memory, Storage and SIM: 2GB RAM | 32GB internal memory expandable up to 512GB | Dual SIM (nano+nano) dual-standby (4G+4G)", "Android Pie v9.0 operating system with 1.8GHz Qualcomm Snapdragon 632 octa core processor, Adreno 506", "4000mAH lithium-ion battery", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase . For any queries related to product please reach out to 1800 103 6286", "Box also includes: Adapter, USB cable, warranty card, user guide, SIM insertion tool, back cover"], "title": "Redmi 7 (Lunar Red, 2GB RAM, SD 632, 32GB Storage, 4000mAH Battery)", "colour": "Lunar Red", "brand": "Redmi", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61P-%2BdWuq%2BL._SL1500_.jpg"], "reviews": ["Planning to buy Redmi 7? Read my review & decide yourself, if it satisfies your needs.", "Bought Redmi 7 in First sale, sharing my experience as below:", "Before that, if buying 2 GB, I'd suggest, at least go for 3 GB Ram variant by adding extra 1k, as in 2 GB MIUI is heavy, itself consumes more than 1 GB Ram.", "Box contains:", "- Handset,", "- 10 watt charger,", "- USB Cable,", "- Sim Insertion tool,", "- Back cover.", "Pros:", "- PERFORMANCE (4/5):", "  Snapdragon 632 Processor: Before this, on REDMI series SoC's were not that powerful, mostly using 4XX series, but now performance of SD 632 is good.", "- BATTERY LIFE (5/5):", "  4000 mAh: I just love Xiaomi, when it comes to battery performance, in moderate use which easily last for a day, In light usage, it lasts over a day and half. 7-8 hrs SOT. To charge from 0-100, it takes 2:20 hrs time.", "- CAMERA (4/5):", "  12MP+2MP Rear camera: which clicks above average pics in good lighting conditions. Colors looks natural.", "  8 MP Front Camera: Edge detection is good.", "  Camera2api support.", "- IR Blaster.", "- Dedicated SD card support, but still all apps are not movable to SD card.", "- Gorilla Glass 5, LED notification.", "- Dual VoLTE.", "- Fingerprint is fast & responsive.", "Cons:", "- Though PUBG works in medium setting, but it crashed few times. So, have to play in low settings.", "- Under direct sunlight, screen looks dull, even with 100% brightness.", "- Screen is HD+ 720p. Not Full HD.", "- Plastic body.", "- Low light camera performance is not upto mark.", "- No EIS (Electronic Image Stabilization).", "- Widevine level L3: no HD content streaming from Netflix/Amazon prime, but it's ok at this price range.", "- Ads ;) but you can turn it off, in setting, just turn off \"Show recommended content\".", "Still, Redmi 7 is good device which you can consider while buying for average daily usage.", "If you are tight on budget, it is value for money. You can buy it.", "Suggestion: If you can spend some extra amount, I'd suggest, Redmi Note 7 is far better than Redmi 7 at 10k, with Better SoC Snapdragon 660, Camera, Screen resolution, glass back, Quick charge.", "Other suggestions: Asus Zenfone Max Pro M2, Realme 3.", "---------------------------------------", "Good mobile", "Camera 4/5", "Battery 5/5", "Display 4/5", "Sound 4/5", "Best budget all rounder from Xiaomi", "The gradient colour looks amazing.", "Good product, looking nice...", "Display quality poor. Not supported 1080p. Low quality display", "Camera quality is very low.", "Vest of money", "This phone is amazing i got it easily on the sale & they delivered it in one day.. the display is amazing.. even the charging speed is unbelievable ... Best all rounder under 10k", "Worst Camera, No EIS for videos,", "Battery heating a lot while charging,", "Phone also get heating so much,", "Planning to buy Redmi 7? Read my review & decide yourself, if it satisfies your needs.", "Bought Redmi 7 in First sale, sharing my experience as below:", "Performance: 4/5", "Battery: 5/5", "Camera: 4/5", "Display: 4/5", "Price: 4/5", "Pros:", "- PERFORMANCE:", "  Snapdragon 632 Processor: which offers good performance, even in multi tasking.", "- BATTERY LIFE:", "  4000 mAh: I just love Xiaomi, when it comes to battery performance, in moderate use which easily last for a day,. 7-8 hrs SOT. To charge from 0-100, it takes 2:20 hrs time.", "- CAMERA:", "  12MP+2MP Rear camera: which clicks above average pics in good lighting conditions. Colors looks natural.", "  8 MP Front Camera: Edge detection is good.", "  Camera2api support.", "- IR Blaster.", "- Dedicated SD card support, but still all apps are not movable to SD card.", "- Gorilla Glass 5, LED notification.", "- Red color looks really beautiful & stunning.", "- Dual VoLTE.", "- Fingerprint is fast & responsive.", "Cons:", "- Though PUBG works in medium setting, but it crashed few times. So, have to play in low settings.", "- Under direct sunlight, screen looks dull, even with 100% brightness.", "- Screen is HD+ 720p. Not Full HD.", "- Plastic body.", "- Low light camera performance is not upto mark.", "- No EIS (Electronic Image Stabilization).", "- Widevine level L3: no HD content streaming from Netflix/Amazon prime, but it's ok at this price range.", "- Ads ;) but you can turn it off, in setting, just turn off \"Show recommended content\".", "If buying 2 GB, I'd suggest, at least go for 3 GB Ram variant by adding extra 1k, as in 2 GB MIUI is heavy, itself consumes more than 1 GB Ram.", "Still, Redmi 7 is good device which you can consider while buying for average daily usage.", "If you are tight on budget, it is value for money. You can buy it.", "Suggestion: If you can spend some extra amount, I'd suggest, Redmi Note 7 which is far better than Redmi 7 at 10k, with Better SoC Snapdragon 660, Camera, Screen resolution, glass back, Quick charge.", "Other suggestions: Asus Zenfone Max Pro M2, Realme 3.", "---------------------------------------"], "instock": false, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/61P-%2BdWuq%2BL._SL1500_.jpg", "path": "full/1148ffee0e7c6958c8a58c37a8e5c82f08539fe9.jpg", "checksum": "6abdb00a0c8fa130fd06088d660d4ca3"}], "price": "₹ 6,999.00"},
{"rating": "4.3 out of 5 stars", "description": ["13MP + 5MP + 5MP Triple Rear Camera | 16MP front facing camera", "16.21 centimeters (6.4-inch) FHD+ capacitive touchscreen with 2340 x 1080 pixels resolution 16M color support", "Memory, Storage & SIM: 3GB RAM | 32GB storage expandable up to 512GB | Dual nano SIM with dual standby (4G+4G)", "Android Pie operating system with 1.8 GHz Exynos 7904 octa core processor", "5000mAH lithium-ion battery with fast charging | 15W Type-C fast charger in the box", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Travel Adapter, USB Cable, Ejection Pin, User Manual"], "title": "Samsung Galaxy M30 (Stainless Black, 3GB RAM, Super AMOLED Display, 32GB Storage, 5000mAH Battery)", "colour": "Stainless Black", "brand": "Samsung", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81bjpVu5s5L._SL1500_.jpg"], "reviews": ["Don't fall for the  negative reviews. This is best at the price. People following red mi phones but this has bigger advantage. I will write only advantages and cons and feedback", " Advantage", "-Amoled display.", "-Always on display (I compromised but it's there)", "-5000 Mah battery and runs 2 days.", "-Fast charging and 15W charger in the box.", "-Wide angle camera is awsum.", "-No heating no lagging.", "-Face unlock is very fast.", "-Mainly look is stunning.....", "-Very low radiation", "-Blue light filter", "-Lock screen story and stunning pics.", "Cons", "-Little slippery in hand but trust me a 99 Rs cover solved it straight away.", "-Online availability.(Now in stock)", "-No splash proof (as per the other reviews as I am not going to test this anyway?", "Feedback", "feedback", "-People say camera but I find it's too good.", "-People say speaker. One in the bottom is loud  and clear enough.", "-People compare with Mi but forget that China model with LCD display and 0.9 SAR value. M30 has SAR of 0.43", "After Using for 1 week", "-All well and amazing.", "-Working in Telcos with lost of calls phone still has 30% batt on second day. To add i have played game for 30 min and watched online movie for 3 hrs on Jio cinema along with hectic job schedule.", "Last few months I am using this mobile performance wise not bad, if you download any file you can't find where it saved.Display -ok not full HD,Audio- Low", "Speed - you can't play any online games it will be very slow. Earphone -not available.", "Cam-Good, Totally it is an average product, you can use for only calls and watching movies, Phone contains fiber body, we have to handle carefully.", "I just picked up an amazing phone which is Samsung m30 and I'm so happy to make the right decision.", "Talking about this phone, this comes with great battery life and I can strem all my favourite songs and play games without worrying that it may go off. The camera is very good, captures great pics doesn't let me down. My friends take my phone and go on clicking selfies. I already have 400 plus photos in my gallery. The storage capacity is not a worry either, thanks to the 128gb varient.", "The display is really very good. Everything so bright and nice. It is not at all heavy and the gaming performance is great. I'm loving it! :)", "No EarPhone In Box And Mobile Cover Of Samsung M30.", "Samsung Provide Earphones in 2k Mobiles, But Here It's Missing. I Want To Return Samsung M30, Revert If It's Possible Now?", "Phone is just fantastic but one problem in here.. does not work Google play or can't install or update any apps from Google play.. only just install from Samsung Galaxy app😓😓", "A Samsung's new launched M30 Smart phone is very cool because of the Infinity U AMOLED Fhd + Display is looking very nice. 13 MP ultra - wide dual camera & a triple camera setup capture which is clearly so cool with one of the best photography & great selfies. One of best part is that the battery lasts long since it has massive 5000 mAh battery & also 3x Fast Charge. Storage its also an important factor. It has 4GB RAM | 64GB internal memory expandable up to 512GB, it means you have sufficient space where you can downlod videos, movies, songs and data. Next is, it has Dual SIM slots and a dedicated slot for memory card.", "Samsung M30 has", "Exynos 7904 Processor", "1.8 GHz Octa Core Processor & 4GB RAM - multitask gaming, videos, etc.", "Very good screen clarity, it looks very neat and appealing, Camera is very good, low light photography is excellent. Fingerprint sensor is fast and it has good speed which helps me switch between apps smoothly. Gaming on this phone is awesome and it doesn't lag while playing games like PUBG and NFS. The 5000mah battery helps me almost never run out of charge . The charger included with the phone charges my phone in a matter of minutes. The AMOLED display helps me see clearer images and lets me watch movies in high definition.The Dolby digital feature helps me listen to music in high quality sound with a beautiful infinity V cut display the phone looks better than anyone. I love it", "Liked-", "Battery backup (3days)", "Wide Camera feature", "Simple UI", "3 slots sim+mmc", "Disliked-", "Slippery", "NO Pie update", "only single speaker at the bottom"], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81bjpVu5s5L._SL1500_.jpg", "path": "full/5873f0019b350bdb380aaca632081f1297a6dcfa.jpg", "checksum": "dfba706bf55201302d87288a790e25fd"}], "price": "₹ 9,999.00"},
{"rating": "4.5 out of 5 stars", "description": ["6.1-inch Liquid Retina display (LCD)", "IP67 water and dust resistant (maximum depth of 1 meter up to 30 minutes)", "12MP camera with OIS and 7MP TrueDepth front camera—Portrait mode, Portrait Lighting, Depth Control, and Smart HDR", "Face ID for secure authentication", "A12 Bionic with next-generation Neural Engine", "Wireless charging—works with Qi chargers", "iOS 12 with Memoji, Screen Time, Siri Shortcuts, and Group FaceTime"], "title": "Apple iPhone XR (64GB) - Black", "colour": "Black", "brand": "Apple", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/519KIlHA2wL._SL1024_.jpg"], "reviews": ["NOTE:", "@ This is detailed comparison between iPhone 8, X, XS & XR, after using each of them for a month.", "@ I am also stating the detailed battery performance of each phone.", "This is a long review, but its worth if you willing to spend your hard earned money.", "BUILT QUALITY :", "--------------------", "# iphone 8 and XR have glass front and back, ringed with metal frames (aluminum), which looks more premium and worth the price you pay. But also are susceptible  to easy damages.", "# iphone X and XS are made of stainless steel, which don't appears that luxurious comparatively, but are more sturdier and less prone to damage compared to 8 and XR.", "# Among all iphone 8 is lightest and XR heaviest, with X and XS being almost similarly weighed.", "# To me in this parameter, iphone 8 seems the better choice.", "DISPLAY :", "-----------", "# iphone 8 has smallest display(4.7\") and XR the biggest(6.1\"), with X and XS with same size(5.8\"), so is the screen to body ratio.", "# Display resolution of X and XS is same and the best amongst all, while 8 and XR is same and lowest ( NOT even FHD ).", " Similarly, X & XS have OLED, while 8 & XR have LCD :P", "# According to my usage I found X & XS to be much better value for money in terms of display quality.", "SYSTEM PERFORMANCE :", "-----------------------------", "# I noticed XS performing slightly better than XR, though both of them have same processor. Followed by X and 8.", "# If you are normal user like me then you wont mind using iphone 8 over XS, as 8 can do everything that XS can easily.", "# I found X to be better value for money in this segment.", "BATTERY PERFORMANCE :", "------------------------------", "# All 4 phones are equipped with fast charging, wireless charging.", "# XR use to last over 20 hours with normal multitasking, with 4G ON continuously all the time.", "*XS use to last between 16-18 hours, X did 14-15 hours and 8 use to lasts upto 12 hours.", "# With Heavy multitasking, XR lasted over 11 hours, XS did over 9 hours, X lasted over 8 hours and 8 lasted upto 6 hours.", "# Certainly XR outshines others in battery performance.", "CAMERA :", "-----------", "# In this segment, I noticed iphone X to be the best among all when using Rear camera.", "* Colours are more punchy and true to real. Night time photography is also excellent.", "# XS sometimes does better over X, but not always.", "# Front camera of X, XS and XR are same and performs almost similarly.", "# Each one supports 4K, OIS, slow motion.", "PRICE (64GB) :", "---------------", "8 - Rs.55K", "X - Rs.75K", "XR - Rs.77k", "XS - Rs.99K", "# Here certainly 8 is winner :P", "P.S: you get a physical home button on iphone 8, which certainly comes handy.", "VERDICT :", "-----------", "After using each phone, I can conclude that if you are tight on budget then going for iphone 8 is best choice.", "If you have 80k to spare, then certainly go for iphone X. And if budget is not in your dictionary, then certainly go for iphone XS.", "To me iphone XR is not worth the price at all, except the battery performance, it doesn't have any noticeable parameter.", "If you already own a iphone 7, then don't upgrade unless, you have money to waste. If you have 6s or below, then only go for upgrade.", "Hope this review helps.", "Very bad experience with this iPhone xr phone. Back camera found defective and non functional. Amazon is very careless. I haven't got any response on confirmation for replacing. I am just hanging with a damaged piece worth of more than 91000 rupees.", "Amazing phone with amazing camera coming from iPhone 7 plus great service from amazon", "So I got the iPhone XR just today. The product looks amazing. But unfortunately the Face ID is not working and there’s a glitch in the front camera’s portrait mode. That’s fine, it may happen. But what’s not fine is the pathetic service provided by amazon and apple. Firstly, amazon takes no responsibility of the product once sold. Talking about the giant, apple, the so called market leaders. Went to the service centre, after running a diagnostic the solution they came up with is sending the phone to Bangalore for repair. Like sending the new phone for repair is the practical solution that the company provides after charging a bomb for the product. And also to mention, amazon.in is not an authorised apple reseller. I guess this issue will be escalated to the consumer court. Thank you amazon and apple!", "I've been an android user all my life until I decided to try iPhone XR for iOS. Loving the camera and battery life is an absolute joy to have. It's been more than one month since I got this phone and I'm loving it. Face ID works flawlessly even in the dark and the dual sim function is working like a charm, I'm using Vodafone as my primary sim and Jio as e-sim and have faced no problem whatsoever.", "The camera is better compared to my previous android phone. The camera support \"live photo\" which I disabled it because I'm not used to it. It supports video recording at 4K 60 FPS. The camera also supports panorama mode which gives amazing results. Selfie is also good and the screen light up as flashlight when taking a selfie in the dark.", "I'm not a gamer but I play Clash Royale and the game works smoothly. Since the phone has the latest processor I'm sure it won't be a problem even with the latest game.", "I'm loving iOS so far but I miss the bottom keys found on Android. iOS is fluid and there are no flaws in the OS which I've encountered. I've got two minor iOS updates after my purchase and love how updates are distributed globally all at the same time. One minor inconvenience I found on iOS is to download apps more than 150 MB I'm forced to connect to wifi and so far I've not found a work around it. I got adapted to gesture navigation like it was something I've been using for ages.", "Face ID is an absolute joy to have as I don't have to do anything to unlock my phone, I just hold my phone and the phone is unlocked. And did I mention that Face ID works even in the dark? The lack of notification LED is not a big inconvenience as the screen lights up to show the notification every time I hold up my phone.", "Regarding the huge criticism it got for the low screen resolution, I don't see any problem as I hardly stream YouTube in 4K. I can view YouTube videos in 1080p without a problem which I feel is good enough as service providers in India never give enough data speed to stream videos in 4K. Regarding the screen in direct sunlight, there's no problem as the screen is clearly visible even under direct sunlight.", "The speakers on this one are a huge plus point over other devices as the speakers give a 3D surround sound like system. I love the speakers on this phone. Regarding the lack of 3.5 mm headphone jack, I see no problem as the phone is bundled with an earphone which connects to the phone.", "And yeah If you're wondering how Siri is, let me tell you that google assistant is a much better one. I've installed google assistant and I use google assistant more than Siri as google assistant is more practical. If I were to rate google assistant and Siri on a scale, 10 being the best then I would rate Siri at 5 and google assistant at 9.", "Overall I'm extremely happy with my purchase as I got it at 58,500 rupees for the 64 GB version. If anyone wants to give iOS a try then I highly recommend iPhone XR as it is the latest devices from Apple at a reasonable price. The one thing that pushed me into iOS is that Apple gives OS update for 6 years and there is no delay in OS updates. On Android, it is a pain waiting for the manufacturer to release the update after Google outs the update.  I hope my simple review of iPhone XR helped you. Thank you for reading. Cheers.", "It has been a month since I started using my iPhone XR and the experience has been awesome. Excellent battery life, smooth operating system, and most of all, dual Sim functionality are the best features of this iPhone. Spent so many days to decide on the colour, but opted for white, and I’m very happy about it. Coral is also a very good colour option which I have bought for my wife. Only issue bothering me is the time taken to charge the phone. You need to opt for overnight charging. Other than that, extremely happy with the purchase."], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/519KIlHA2wL._SL1024_.jpg", "path": "full/8f2e60bdac58c4d985743931454ee900fd485d5f.jpg", "checksum": "e8002e289ed359f9f6ca7b148a5d684e"}], "price": "₹ 49,900.00"},
{"rating": "4.0 out of 5 stars", "description": ["12MP rear camera with large 1.25μm pixels | 5MP front camera", "13.84 centimeters (5.45 inch) HD+ full screen display with 1440 x 720 pixels resolution", "Memory, Storage & SIM: 2GB RAM | 16GB internal memory expandable up to 256GB | Dual SIM (nano+nano) dual-standby (4G+4G)", "Android Pie v9.0 operating system with 2.0Ghz Snapdragon 439 octa core processor with 12nm FinFET technology", "4000mAH lithium-polymer battery", "2 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also Includes: Power adapter, USB cable, SIM eject tool, warranty card and user guide"], "title": "Redmi 7A (Matte Blue, 2GB RAM, 32GB Storage)", "colour": "Matte Blue", "brand": "Redmi", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71CyW7YCRaL._SL1500_.jpg"], "reviews": ["Mobile is not  doing good work", "The 7A is nothing extraordinary to look at but neither is it ugly.You'll find all the basics like a practical design, curved back, front + rear cameras and 3.5mm audio jack.", "Good qualities:Smooth performance, triple card slot, fast face unlock, wireless FM (no headset needed) + FM recording, large battery, great camera (esp. for the segment), matte finish polycarbonate back panel, splash resistant P2i coating.", "Bad qualities:No fingerprint unlock, skips the IR emitter port, supports 10W charging but only 5W charger included.", "Value of money 8", "Performance 6", "OK for this amount", "Servec not good", "Product is good but The cover didn't come along", "Some times double tap screen light on not working... There is no option to crop select on while taking screen shot.... There is no VR mode... Remaining all good", "When u are not using the phone for 30-40 minutes  the double tap to wake up phone does not work properly & same problem with face unlock feature. Plz help", "Charging very slow"], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71CyW7YCRaL._SL1500_.jpg", "path": "full/56115cced7a0328b600245309830821f2c589b9e.jpg", "checksum": "3ec86cc4ea13a1bed07da6f88782cc00"}], "price": "₹ 5,799.00"},
{"rating": "4.0 out of 5 stars", "description": ["12MP rear camera with large 1.25μm pixels | 5MP front camera", "13.84 centimeters (5.45 inch) HD+ full screen display with 1440 x 720 pixels resolution", "Memory, Storage & SIM: 2GB RAM | 16GB internal memory expandable up to 256GB | Dual SIM (nano+nano) dual-standby (4G+4G)", "Android Pie v9.0 operating system with 2.0Ghz Snapdragon 439 octa core processor with 12nm FinFET technology", "4000mAH lithium-polymer battery", "2 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also Includes: Power adapter, USB cable, SIM eject tool, warranty card and user guide"], "title": "Redmi 7A (Matte Black, 2GB RAM, 16GB Storage)", "colour": "Matte Black", "brand": "Redmi", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71YK3AQN02L._SL1500_.jpg"], "reviews": ["Mobile is not  doing good work", "The 7A is nothing extraordinary to look at but neither is it ugly.You'll find all the basics like a practical design, curved back, front + rear cameras and 3.5mm audio jack.", "Good qualities:Smooth performance, triple card slot, fast face unlock, wireless FM (no headset needed) + FM recording, large battery, great camera (esp. for the segment), matte finish polycarbonate back panel, splash resistant P2i coating.", "Bad qualities:No fingerprint unlock, skips the IR emitter port, supports 10W charging but only 5W charger included.", "Value of money 8", "Performance 6", "OK for this amount", "Servec not good", "Product is good but The cover didn't come along", "Some times double tap screen light on not working... There is no option to crop select on while taking screen shot.... There is no VR mode... Remaining all good", "When u are not using the phone for 30-40 minutes  the double tap to wake up phone does not work properly & same problem with face unlock feature. Plz help", "Charging very slow"], "instock": false, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71YK3AQN02L._SL1500_.jpg", "path": "full/2f23b250a2b1978f877ee06677f4b3d4f5fb6058.jpg", "checksum": "80c9732b6b1e85e8af771eb82be04f51"}], "price": "₹ 4,999.00"},
{"rating": "4.6 out of 5 stars", "description": ["48+8+2+2MP rear camera with photo, video, professional mode, panorama, portrait, night scene, time-lapse photography, slow motion and 16MP front facing camera", "16.5 centimeters (6.5-inch) AMOLED display with 2340 x 1080 pixels resolution, 394 ppi pixel density and 16M color support | Corning Gorilla Glass 5 protection with screen-to-body ratio of 91.6%", "Memory, Storage & SIM: 8GB RAM | 128GB internal memory expandable up to 128GB | Dual SIM (nano+nano) dual-standby (4G+4G)", "Android v9.0 based on Color OS 6.1 operating system with 2.0GHz Helio P70 octa core processor, ARM Mali-G72", "4000mAH lithium-polymer battery", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Type-C cable, SIM tray ejecter, pre-applied screen protector and protective case, booklet with warranty card and quick guide"], "title": "OPPO Reno2 F (Lake Green, 8GB RAM, 128GB Storage) with No Cost EMI/Additional Exchange Offers", "colour": "Lake Green", "brand": "Oppo", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/8121-n8-ekL._SL1500_.jpg"], "reviews": ["Honest review after 2 days of usage.", "Camera 9/10", "Performance 8.5/10", "Sound Quality 9.2/10", "Battery 9/10", "Offers 10/10", "Overall experience 9.5/10", "I am fan of OPPO for next 10 years.", "Amazing body colour", "Amazing camera quality", "Pop with less", "Excellent touch sensor", "So much satisfied after buying such a great great mobile", "Got this phone for 16k after exchange of my old phn. Overall experience is quite good. Charging speed is fast as specified. Camera works good with day light as well as night shots. Front camera looks stunning with 12 color pop up slider. Must buy phone with Amezon offer..", "Awesome product at this price range. Camera is so perfect.", "it should be 22 k", "Nice camera phone", "Best camera mobile", "Best Mobile , supab", " camera"], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/8121-n8-ekL._SL1500_.jpg", "path": "full/6710e74fe3e3db203e92a28a74845f4886e48c55.jpg", "checksum": "747aba7a45c52145068ba09784f551e6"}], "price": "₹ 25,990.00"},
{"rating": "4.3 out of 5 stars", "description": ["13MP + 5MP primary camera | 8MP front facing camera", "16.21 centimeters (6.4-inch) HD+ capacitive touchscreen with 720 x 1560 pixels resolution 16M color support", "Memory, Storage & SIM: 3GB RAM | 32GB storage expandable up to 512GB | Dual nano SIM with dual standby (4G+4G)", "Android v9.0 Pie operating system with 1.6 GHz + 1.35 GHz Exynos 7884B octa core processor", "4000mAH lithium-ion battery with fast charging | 15W Type-C fast charger in the box", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Travel Adapter, USB Cable, Ejection Pin, User Manual"], "title": "Samsung Galaxy M10s (Stainless Black, 3GB RAM, Super AMOLED Display, 32GB Storage, 4000mAH Battery)", "colour": "Stainless Black", "brand": "Samsung", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71vZUidoQ7L._SL1500_.jpg"], "reviews": ["Good price value... Samsung m series i loved it", "Good design really liked it. As per YouTube reviews they say the build quality of screen is not good as it doesn't have gorilla glass have to wait and see", "Please please don't buy it this phone has heating problem it is overheating all time Samsung you break our trust please don't make this type of phone that disappoint your die hard fan", "Very good product within range of 10k.", "Working auperb", "Excellent Mobile, worth for money", "Selfie camera could have been better", "Nice phone in this price awesome", "Valuable product"], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71vZUidoQ7L._SL1500_.jpg", "path": "full/78907be0e703035a7a507dade24e960949c4e59b.jpg", "checksum": "17b5f99a88d6aca626a7569f6d30511f"}], "price": "₹ 8,999.00"},
{"rating": "4.3 out of 5 stars", "description": ["48MP + 8MP + 5MP triple rear camera | 16MP front facing camera", "16.21 centimeters (6.4-inch) FHD+ capacitive touchscreen with 2340 x 1080 pixels resolution 16M color support", "Memory, Storage & SIM: 4GB RAM | 64GB storage expandable up to 512GB | Dual nano SIM with dual standby (4G+4G)", "Android v9.0 Pie operating system with 2.3GHz + 1.7GHz Exynos 9611 octa core processor", "6000mAH lithium-ion battery with fast charging | 15W Type-C fast charger in the box", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Travel Adapter, USB Cable, Ejection Pin, User Manual"], "title": "Samsung Galaxy M30s (Sapphire Blue, 4GB RAM, Super AMOLED Display, 64GB Storage, 6000mAH Battery)", "colour": "Sapphire Blue", "brand": "Samsung", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71EvOK7BhuL._SL1500_.jpg"], "reviews": ["Excellent features, there is no con at all... i am enjoying all the way.. flagship mobile features with low budget price... go for it.", "Detailed Review:", "Camera: The rear and front camera quality is great, night mode is good enough to capture good shots. Additional zoom-out features for both front and rear camera is nice to have.", "Battery: I am really happy with battery backup as it lasts up to approx 2 days. Yes, approx 48 hours with medium usage including WiFi and GPS.", "Design, Touch, Look & Feel is awesome and even though it has a 6000mAh battery, it feels light.", "The face recognition is also quick to sense and unlock. The processing speed is good enough for heavy games without much heating effect.", "after 5 days of uses:", "Camera 5/5", "Performances 5/5", "Display 5/5", "Battery 5/5", "Phone look 5/5", "User interface 5/5", "Sound 5/5", "awesome phone", "Best phone with this budget. Best battery.", "Mst phone hain", "a very good smartphone for millennials having monster battery, superior big screen and fast exynos processor.", "the phone has a slippery backcase.", "overall a great smartphone at budget price.", "Received today best buy at given price.", "Awesome Battery life"], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71EvOK7BhuL._SL1500_.jpg", "path": "full/28f4ce8c93defd968607c79d523c09669e5ce43e.jpg", "checksum": "875616166fa15a25b3d3837f18f87971"}], "price": "₹ 13,999.00"}
][
{"title": "Hefty Strong Multipurpose Large Trash Bags, 30 Gallon, 74 Count", "brand": "Hefty", "rating": "4.7 out of 5 stars", "price": "$16.04", "colour": "not defined", "instock": false, "reviews": ["I've been buying the Kirkland bags for years.  After a move to a location where a Costco membership doesn't make sense, I would buy the Kirklands via Amazon.  However, recently I decided to try a less-expensive brand--and chose the Heftys.  They are the same size as the Kirklands and, IMO just as strong.  I don't overfill my bags, and I do one little trick that really helps:  I keep a large Ziploc (usually recycled after another use) magnet-clipped on the side of my refrigerator.  In this I put the sharp tops of all cans, plastic spoons because the cheap ones I use for cat food have really sharp ends, and even the screw tops from wine bottles, because they have sharp little thingies on the sides.  When the bag is full, I zip it shut and throw it in the trash.  Result:  never any leaks in my trash bags, and this has been just as true for the Heftys as it was for the Kirklands.  Finally, I noted that some reviews were negative because of fragrance.  This was a concern for me because I'm extremely sensitive to artificial fragrances, and I have an excellent sense of smell.  However, I decided to take a chance and I'm glad I did.  When fluffing out my first bag to put into the trash bin, I thought, \"is that a fragrance?\"  I actually had to stick my nose into the bag to confirm that it was.  However, it's so light, so subtle that it doesn't bother me one whit: I never notice the fragrance when I'm putting things into the bag many times daily.  By the time I remove a bag , the fragrance has completely dissipated.  So I'm very happy with these bags and their value via Amazon Prime.", "Our usual brand.  Always consistent.  Strong and good size.", "Don't forget to use the Smile.Amazon.com address - It's an Amazon program where many things you buy every day will generate a small donation to the charity of your choice.  Read about it here:  https://smile.amazon.com/gp/chpf/about/ref=smi_se_rspo_laas_aas", "I use these heavier bags in a kitchen-size trash can because the kitchen-size bags kept ripping. I was continually having to put the ripped bags in another bag before putting these bags in my large garbage cans. Bigger than I want, but less mess and fewer bags used in the long run.", "This review is for people like me who do not tolerate artificial fragrances: The box says that it \"May contain a light scent.\"", "My boxes and the bags in them did indeed contain a light scent. To me it was a sickly sweet fragrance. I opened the boxes and put the contents outside to off-gas. I going stored them outside on the carport, but the scent did not go away even after several days. I do like the strength of the bags, but I will be looking for another brand which is truly unscented for my next purchase.", "You wouldn't think there'd be much of a difference in these various bags but there is.  These are better than the others in several ways.  They are study and don't get holes nearly as much as the Glad 'Strong' bags, plus they are far easier to open.  The tie method at the top is way easier to manage than tying  bag tabs alone, plus if you want to add something after tying you can untie and retie easily.  One product with a tie doesn't have a study enough track for the tie and it comes out far too easily so it's worthless to close the bag, where these  are more reliable.  I like them a lot better than the bags that supposedly stretch and have a weird texture.  I haven't found those very sturdy and they are harder to handle.  Gathering and taking out the trash is a pain at the best of times, but these make it a little less annoying. Even my trash man has said he likes these better than other types.", "I generate a lot of waste at the workshop (1-2 of these garbage bags on a work day), and some of it can be heavy. If you exceed about 30 pounds, the drawstrings will definitely break if you lift the bag by the strings. This means you will carry a lot of bags with a hand on the bottom of the bag if you're not careful.", "Good value.  Hold a great deal of heavy garbage.  However do not fill it past half the bag.", "Hefty are my go to trash bags. I like the 30 gal size for my kitchen trash can. They fit and fill the whole can alot better than \"tall kitchen bags\". The hefty bags are very strong and have a good pull tie. I have not had any problems with the bag splitting when full. The black plastic is dark enough so you can not see the trash inside like some translucent black plastic bags. They are unscented and i dont notice any smell. They seem like they do not leak any liquids. Delivery from Amazon was on time and un damaged. I will order again."], "description": ["", "", "Make sure this fits", "", "by entering your model number.", "", "", "This package contains 74 Hefty Strong, large, unscented, 30 gallon black garbage bags, each 1.05 mil thick", "Versatile and strong, these heavy duty Hefty 30 gallon trash bags are ideal for extra-large kitchen cans or big clean up jobs throughout the home, yard and garage", "Signature Hefty quality ensures these trash can liners will offer superior puncture resistance and drawstring dependability", "Hefty large black trash bags feature a thicker gauge plastic to stand up to tough indoor and outdoor jobs while keeping waste hidden", "Hefty trash bags are backed by a 100% satisfaction guarantee"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81J9MR%2BdiIL._SL1427_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81J9MR%2BdiIL._SL1427_.jpg", "path": "full/6bba42d730b756450d5702af8dd15bf577662dc6.jpg", "checksum": "c9737823204270e064801716fed2d4f8"}]},
{"title": "GLAD 70313 Drawstring Outdoor 30-Gallon Trash Bags, 1.05 Mil, 30\" x 33\", Black (Pack of 90)", "brand": "Clorox", "rating": "4.5 out of 5 stars", "price": "$25.69", "colour": "not defined", "instock": false, "reviews": ["If you're tired of going to the grocery store or Walmart and finding these bags in much smaller quantities, than you'll be happy to know that they're available in a quantity of 90 on the Amazon website. If you're a Prime member and get free shipping, than the price for the 90 bags is an excellent deal.", "As for the bags themselves, they're extremely strong and are fully capable of taking a lot of punishment. You can pack these with trash or use them to store items such as pillows, and you'll encounter no problem with breakage. There's nothing worse than carrying your trash to the main garbage receptacle and having the bag rupture, leaving food all over your floor. With these bags, the 1.1 Mil. is quite strong and virtually guarantees that you'll never encounter such a problem. As an added bonus, these bags come with a drawstring, making it much easier to handle the trash.", "The bottom line is that these are a great deal on Amazon and are a great product to boot.", "I got this from Amazon because the average supermarket often does not carry bags above 13 galleons. This style as one big advantage, and one disadvantage, hence the lost star.", "Aside from the large size, the main virtue of the product is its drawstring.  Almost all 13 galleon bags have some built-in method for closing the top. Most larger bags do not, depending on plastic or wire ties. I find gathering the top of a BIG bag of sticky, pokey stuff to be not very easy, so the built-in draw string is a great feature.", "The downside is that that they are just at the thickness suitable for outside work. There are other large bags which are .85 mil. I would never get these. At 1.1 mil, these are almost thick enough for all outside jobs. They would not hold up if you are putting in refuse with pointy ends.", "But, for leaves and grass, these are probably the best, and will hold up under being filled to the brim with soft organic material.", "So it's hard to rate trash bags.  Best case scenario, they hold your trash and the sides and the pull strings don't rip.  Luckily, these trash bags are the best case scenario.  I suppose I should only give it 4 stars in case a future trash bag with the same performance and some fancy LED blinky lights comes out, but I think I'm fairly safe in just giving these 5 stars.  We've purchased these many, many times, and they are our house large trash bag.  We use them to hold lawn trash, and we also double bag all of our trash.  This bag serves as a great second bag to make sure no flies, etc., get into the first trash bag.", "I'm disappointed with these and will go back to the Kirkland brand next time.  They aren't strong in the sense that I need.  When you fill them and try to lift them out of a bin they stretch and tear and woe betide you if you put anything pointed or sharp from the garden in them.", "The bag size and strength are just perfect for my outdoor yard needs and indoor trash. I ordered these in August and am trying to work my way through the box to find some brand that is scent free. The odor from these just nauseates me and it's especially bad when working outside; raking, pruning, etc. with that horrid sweet artificial fragrance. I will not reorder these. Indeed, I have to store them out in the garage so the smell doesn't invade my closet.", "I find these bags to be stronger than any of the \"flex\" variations of bags out there. Simply put, using a bag that's large enough to accommodate the trash you're putting in there is a far simpler solution than trying to cram 12 gallons of stupid into a 10 gallon hat, as the expression goes. I'll use these in any can 10-30 gallons. Tie it when you're done, and you're done. That's it.", "the ties are not threaded through like they should be if their all like this i wouldn't even give them a one star would have sent them back but needed them can only fill have full in order to be able to tie them first time I've bot from amazon and got riped off very disappointed with product", "We have been purchasing these for a few years now and at first they were great. We had no issues with them at all up until the past 2 boxes we have purchased.  When trying to pull the bags out they seem to be melted together so you have to pull them apart. Once you do that you are left with holes in the bags.  Will not be purchasing them again."], "description": [], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71cvCWJThOL._SL1000_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71cvCWJThOL._SL1000_.jpg", "path": "full/5cf5d76cbb16b35bbd5c4d25fcd579697bf9e964.jpg", "checksum": "2932f50acb1e86c349b0d7ae542f2caa"}]},
{"title": "Heavy Duty Contractor Bags by Ultrasac - (VALUE 50 PACK /w TIES), 42 Gallon, 2'9\" X 4' - 3 MIL Thick Large Black Industrial Garbage Trashbags for Construction and Commercial use", "brand": "Aluf Plastics", "rating": "4.3 out of 5 stars", "price": "$24.99", "colour": "not defined", "instock": false, "reviews": ["Bags are think, but they tear very easily.  Not suitable for heavy duty use.  Anything , even small twigs will puncture them..  This is the lowest grade film I have seen", "I guess if you want to use them for talc powder, or screened sawdust, they are perfect.", "The box I bought made for lousy contractor bags.  They might be ok for normal trash bags.  They are light weight and tear or puncture easily, making them worthless to me for actual contractor trash.  Plus these do not tie at the top, you have to use wire ties, which were included, but a hassle for me to keep track of and not lose when working.  Again, normal home use (with normal home trash) in a trash can - probably fine.", "These are thick bags.  They seem to hold 3 to 4 13 gallon trash bags as I use them for excess trash when needed.  However, they do not have easily tie-able ends.  I've had to use a stapler for this.  You have to push down and strain to get these to tie...  If they were a bit wider and if they had extended ends for tieing, this would be a winner.  As they are now, you can only fill 3/4 of the way full, because you need the last 1/4 to leave space to tie...", "I got these bags to use for our large plastic trash cans at my gallery and they work great. The regular black trash bags weren't big enough for the opening of the cans. These are really thick and don't tear when they are full of cans and bottles. I like that they are large enough to stretch around the edge of the cans so that the bags don't fall inside. So far, we haven't had one tear on us yet, and we often fill them with heavy stuff, sharp stuff, messy stuff. If you need a tough bag, these work great.", "I bought these bags to hold bulky and miscellaneous items that would not fit in cardboard boxes, when moving to a new home, but I also found they are great for wrapping around furniture and appliances with tape, to protect them from being scratched or getting dirty. I ordered enough to use for this move plus my next move. They also are a good alternative to cardboard boxes for storing clothes and bedding, because if tied properly or taped closed, they will keep out dust and moisture, and prevent mildew and moth damage. Because the bags are made of a thicker plastic than ordinary flimsy trash bags, they hold up much better.", "Unimpressed!  The provided ties were so small they didn’t even fit around closed bag!  They were thinner and more fragile then other contract bags I have purchased!  I would have returned but in the middle of the project and didn’t want to run to HD or Lowes.  Ended up using 2 almost every time.  My standard garbage bags though not as thick worked just as well.  I do not recommend this product.", "I live in a house with 2 other people. We are really messy people. But, with that said, these trash bags are awesome pawsome! They're extremely tough, no matter how much junk we throw in it. I mean, we could fill it with all kinds of heavy trash/garbage and it still won't rip. If you're definitely looking for a reliable trash bag, whether for personal or business, buy these. They get an A+ from me!", "I spent a lot of time comparing price/MIL/gallon size. The price was right for 50, so I bought these. Assumed they were what the photo showed -- self-tying. They just arrived and seem as heavy-weight as the ones I'd just used up. But very disappointed they are not self-tying, as the photo implies. Had to scroll waaay down on the page just now to see they have twist-ties. And they are just cheap white standard ties in a strip -- longer than bread ties, but no stronger/wider. Can't imagine they would keep a heavy bag closed well. They need to fix the photo and put this info up front. Will take years to use up, but prefer I'd have 50 self-tying ones! I might try cutting some of them to create the self-ties. Wish I still had one of my old ones, for a pattern.", "UPDATE-  OK -- I see in the top description they say \"with ties\" but I didn't pay attention to that because I saw the picture - and assumed it was \"built-in ties\". My bad. But be warned if you wanted that kind!"], "description": [], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81fPXFkAXmL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81fPXFkAXmL._SL1500_.jpg", "path": "full/ee3aff0ec90fc7be98f7ecd56cc3fabc636a1c8b.jpg", "checksum": "26a9e29c731ea82c2ae8ab7a4ba01705"}]},
{"title": "UltraSac 33 Gallon Trash Bags - (Huge 100 Pack/w Ties) - 39' x 33' Heavy Duty Large Professional Quality Black Garbage Bags - Extra Strong Plastic Trashbags for Home, Kitchen, Lawn, and Other", "brand": "Aluf Plastics", "rating": "4.5 out of 5 stars", "price": "$18.50", "colour": "not defined", "instock": false, "reviews": ["These are amazing for the price.  Lets begin with the weight.  The Amazon box was ripped when I found it on my porch. why?  Because this little box of garbage bags weighs 15 pounds.  when you have two boxes of these in a brown box and life it, you'll think there are dumbells in the box. That is professional quality right there.", "Next, each bag is folded.  I love this.  When I buy a box of 100 bags in the store, you know what you get.  Two rolls of 50 bags.  That works great for some people, but for me I like the ability to store garbage bags in multiple places.  Before. i would have to unroll a couple and try to fold them into neat little squares.  This was a major pain, as it wasted time.", "These bags let me grab as many as I need and go.  This also lets me look in the box and see how many bags I really have left.  When I have rolls of bags, I always think I have more than I actually do. So garbage day comes and while I think I have six bags left in the roll, I only have three.  That is always a bummer.", "Major brands have neat features like stretchable bags that won't tear, and make claims that their new bags use 50% less material but are 30% stronger.  It doesn't take a rocket scientist to figure out these are cost saving measures that they wish they implemented years ago.  Think about it.  For the average family, garbage bags don't have to be super strong.  Garbage is garbage.  Its not bricks. People hate overloading garbage bags because they don't want to carry a heavy bag outside. The major brands could pass the savings onto you and hive you 50% more bags, but they won't.", "These bags don't have special features like flexible plastic or any of that", "nonsense.  They are called professional quality.  They are.  They will hold garbage just fine.  They probably could hold bricks.", "i know these are tough bags because they passed what I call \"Ultimate Cat Litter Challenge\".  The challenge is for one 33 gallon bag to be able to hold 40 pounds of used cat litter from three litter boxes (So  figure at least 60 pounds) from the basement, up 15 stairs in a narrow walkway, through my kitchen, hallway, and outside.  Along the way the bags may hit the wall a bit.", "The challenge occurs every Wednesday night.  About ten different brands have been tested.  The majority fail the initial test and i end up double bagging the litter or splitting it into two bags so I don't have to clean up cat feces.  The flexible bags develop tiny leaks in the corners of the bag within a minute of being held.  This results in the litter pouring out as I walk up the stairs.  The thin bags do a little better, but they seem to stretch before ripping open.  Some brands just blow apart when they are lifted. i tried a brand with super strong drawstrings and was left holding the drawstring.", "These guys are thick. They hold the litter and I was so impressed and confident about these bags, I can actually throw the bag over my shoulder without it exploding.  If they can handle the Ultimate Cat Litter Challenge they can handle anything.", "For the price, with free shipping. These guys are super cheap.  I don't know if its because they are made from recycled  (I think used tires? Maybe that's why they are so strong?) I'm used to paying a few bucks cheaper for 50 bags.  My houses uses on average 5 bags a week.  This box of 100 will last me 20 weeks.  I have a gift card that I am using to order 50 boxes of these bad boys.  I'll never have to buy garbage bags until 2034.", "A lot of bags claim to be heavy duty but I can assure you that these are actually heavy duty. I got them to use at my work which is a machine shop. We use them through out the shop for all kinds of trash. We've been using these for a while and no one has managed to rip one yet. That is a huge deal for us. I work with a bunch of guys who think when a trash can is full you just need to compact whats in it to make room instead of changing the bag. With that being said I will be buying these for a long time as long as the quality stays amazing.", "Bought these for my business and my employee pointed out that they're all splitting down the side before she can get them out of the can and too the dump.", "Back to search for something better....", "These trash bags are huge, sturdy-- just about perfect.  They aren't particularly stretchy, which I think is a plus because it makes them less prone to ripping.  We use for regular trash (we have a huge indoor trash can) and we haven't had a single one rip or puncture.  Have bought several times now.  Only objection I have is that on last batch, box slightly redesigned.  It used to open in the middle of the top (kind of like a tissue box) but now you have to open the box flaps.  I prefer just reaching in and grabbing a bag to opening the flaps on the box.  The bags themselves, though, remain our favorites.", "My favorite garbage bags! They fit in my custom designed roll-out garbage-biin drawer, unlike the standard size bags, which are too small. They're very tough bags, with excellent poke-through resistance. I load them up, sometimes with 25-30 pounds of kitchen/household trash, including broken jars, old misshapen wire hangers, sharp-edged un-recycleable plastic containers, and all sorts of things that would rip holes in lesser garbage bags. The bag holds it all together as I drag it out of the wooden garbage drawer, empty various other waste baskets into it, haul it out to the garbage cart, and heave it in. That's more than I can say for the grocery-store bags, which tear at half the load of these bags. So load 'em up, these aren't milquetoast garbage bags.", "Where I live, it became impossible to find trash bags with twist ties years ago. Flaps, drawstrings, whatever, but no twist ties. But twist ties give you way more flexibility. You can tie off a small heavy load, still open the bag easily to add one last item, and if you're careful you can fill it waaay up and still tie it off securely (and it will stay tied off until it lands in the garbage truck!)", "Plus these bags are strong. They are a heavy weight plastic, not too stretchy, with secure bottom seams. AND you get them in boxes of 100. What's not to love?", "Added on edit: can't believe I forgot this part. These bags are pre-cut. And folded. So you don't have to juggle a large roll, try to find the perforation, try to get the bag to separate at the perforation, and so on. You just... pick one up. That's it! Like I said, what's not to love?", "Five stars. Definitely.", "These are NOT wimpy trash bags. They are large, they are heavy duty, and they are opaque. They are perfect if you are the sort of person that lets trash accumulate then discards it all at once.", "A box weighs in at 13 pounds and contains 100 individually folded 33-gallon garbage bags and ties for closing them. The bags are opaque black.", "When shopping for trash bags be certain that you are getting actual trash bags and not trash liners - trash liners tend to be very thin and can be punctured by the corner of an envelope. These garbage bags are 1.4 millimeters thick  which makes them ideal for cardboard, cans, bottles, papers, and everything else your average household or business will throw in them. These will survive the trip to the curb and rough handling from the sanitation workers."], "description": ["", "", "Make sure this fits", "", "by entering your model number.", "", "", "Frustration Free - Our Ultra Sac 33 Gallon Garbage bags are as tough as it gets. 1. 4 Mil thick gauge means your project will stay puncture, tear, and frustration free.", "Save Money - Ultra sac 33 Gal heavy duty large trash bags are hard on junk; not on your wallet. At just 18 cents per bag, we provide the same value the big brands do at half the price.", "Proudly Made in the USA - All Ultra Sac trash bags are carefully and proudly made in the United States of America.", "Save the - Our 33gal trash liners are made from at least 90% percent recycled material. Feel good knowing you are reducing landfill waste without sacrificing on quality.", "Never Waste a Bag - Our premium large garbage bags are packed neatly and disperse one at a time so no bag ever goes wasted."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81Tdo8ii8iL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81Tdo8ii8iL._SL1500_.jpg", "path": "full/978db0e7926578a010b2f11b86cf7023b6505b9c.jpg", "checksum": "1644e4744206fa7aa0cbc675a2d9fdc1"}]},
{"title": "Jaguar Plastics RH3037S 20-30 Gallon 30-Inch by 37-Inch 16-Mic Natural HDPE Can Liner (Case of 500)", "brand": "Jaguar", "rating": "4.0 out of 5 stars", "price": "$55.60", "colour": "not defined", "instock": false, "reviews": ["Great bags.  Good thickness for trash or recycling, rarely rip or tear.  Hard to find them at consistent price online though, keeps changing.  Good product though.", "My only small complaint is that I have purchased bags like this before and they were pre cut and not in a roll that had to be torn.  These bags have to be torn off and it is a bit of a pain to find the end.  Other than that, they are great."], "description": [], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71U6TAK9MUL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71U6TAK9MUL._SL1500_.jpg", "path": "full/84d320c5e342ad046542b68702f33bef0e08cd08.jpg", "checksum": "26c422fc41606545a4768c1a678d1bc7"}]},
{"title": "Pitt Plastics TI3957S Titanium Low-Density Can Liners, 55-60 gal, 1.7 mil, 39 x 57, Silver (Case of 50)", "brand": "Pitt Plastics", "rating": "Previous page of related Sponsored Products", "price": "$37.17", "colour": "not defined", "instock": false, "reviews": [], "description": [], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81rLPNGtWML._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81rLPNGtWML._SL1500_.jpg", "path": "full/89af6c2ae82cea124787ef624689f0c13914eeae.jpg", "checksum": "bf0c3c61d9b106ddad7efff8e7b3cf3d"}]}
]